rocksdb/aep/workloadb.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/rocksdb-binding/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/core-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jcip-annotations-1.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-api-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-simple-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/rocksdb-binding-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/fb-rocksdbjni-5.18.0.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadb -p rocksdb.dir=/pmem/ycsb-rocksdb-xiaohu -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadb -p rocksdb.dir=/pmem/ycsb-rocksdb-xiaohu -t
YCSB Client 0.15.0

Loading workload...
Starting test.
[Thread-3] INFO com.yahoo.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /pmem/ycsb-rocksdb-xiaohu
2018-12-30 07:57:52:889 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-30 07:58:02:840 10 sec: 435690 operations; 43564.64 current ops/sec; est completion in 3 minutes [READ: Count=414302, Max=124671, Min=0, Avg=18.54, 90=32, 99=46, 99.9=63, 99.99=111] [UPDATE: Count=21575, Max=519, Min=5, Avg=28.09, 90=44, 99=65, 99.9=97, 99.99=129] 
2018-12-30 07:58:12:840 20 sec: 1179651 operations; 74396.1 current ops/sec; est completion in 2 minutes [READ: Count=706828, Max=95167, Min=0, Avg=12.08, 90=22, 99=26, 99.9=31, 99.99=37] [UPDATE: Count=37008, Max=80, Min=4, Avg=20.47, 90=31, 99=38, 99.9=44, 99.99=51] 
2018-12-30 07:58:22:846 30 sec: 1939703 operations; 75952.03 current ops/sec; est completion in 2 minutes [READ: Count=721708, Max=9887, Min=0, Avg=11.75, 90=22, 99=26, 99.9=29, 99.99=32] [UPDATE: Count=38350, Max=2267, Min=5, Avg=20.54, 90=31, 99=37, 99.9=42, 99.99=45] 
2018-12-30 07:58:32:841 40 sec: 2718273 operations; 77895.95 current ops/sec; est completion in 1 minute [READ: Count=739415, Max=37087, Min=0, Avg=11.44, 90=22, 99=26, 99.9=31, 99.99=51] [UPDATE: Count=39147, Max=87, Min=5, Avg=20.18, 90=31, 99=37, 99.9=44, 99.99=63] 
2018-12-30 07:58:42:847 50 sec: 3522339 operations; 80366.42 current ops/sec; est completion in 1 minute [READ: Count=763819, Max=10895, Min=0, Avg=11.06, 90=22, 99=25, 99.9=28, 99.99=32] [UPDATE: Count=40293, Max=47, Min=5, Avg=19.75, 90=31, 99=37, 99.9=41, 99.99=44] 
2018-12-30 07:58:52:841 60 sec: 4345839 operations; 82391.2 current ops/sec; est completion in 1 minute [READ: Count=782035, Max=20447, Min=0, Avg=10.77, 90=21, 99=25, 99.9=28, 99.99=32] [UPDATE: Count=41428, Max=56, Min=5, Avg=19.41, 90=31, 99=36, 99.9=42, 99.99=49] 
2018-12-30 07:59:02:844 70 sec: 5166479 operations; 82039.39 current ops/sec; est completion in 1 minute [READ: Count=779774, Max=6087, Min=0, Avg=10.81, 90=22, 99=25, 99.9=28, 99.99=31] [UPDATE: Count=40858, Max=46, Min=5, Avg=19.68, 90=31, 99=37, 99.9=42, 99.99=45] 
2018-12-30 07:59:12:841 80 sec: 5993217 operations; 82698.61 current ops/sec; est completion in 54 seconds [READ: Count=785696, Max=51199, Min=0, Avg=10.72, 90=22, 99=25, 99.9=28, 99.99=45] [UPDATE: Count=41061, Max=78, Min=5, Avg=19.52, 90=31, 99=37, 99.9=43, 99.99=71] 
2018-12-30 07:59:22:838 90 sec: 6834242 operations; 84127.74 current ops/sec; est completion in 42 seconds [READ: Count=799102, Max=5511, Min=0, Avg=10.52, 90=21, 99=25, 99.9=27, 99.99=30] [UPDATE: Count=41907, Max=51, Min=5, Avg=19.23, 90=31, 99=36, 99.9=42, 99.99=48] 
2018-12-30 07:59:32:838 100 sec: 7663130 operations; 82888.8 current ops/sec; est completion in 31 seconds [READ: Count=787598, Max=2091, Min=0, Avg=10.48, 90=22, 99=25, 99.9=32, 99.99=51] [UPDATE: Count=41267, Max=82047, Min=5, Avg=21.29, 90=31, 99=37, 99.9=47, 99.99=87] 
2018-12-30 07:59:42:843 110 sec: 8492782 operations; 82932.03 current ops/sec; est completion in 20 seconds [READ: Count=787764, Max=48991, Min=0, Avg=10.66, 90=22, 99=26, 99.9=34, 99.99=60] [UPDATE: Count=41881, Max=110, Min=5, Avg=19.69, 90=31, 99=38, 99.9=46, 99.99=76] 
2018-12-30 07:59:52:842 120 sec: 9212882 operations; 72017.2 current ops/sec; est completion in 11 seconds [READ: Count=683921, Max=7463, Min=0, Avg=12.26, 90=25, 99=29, 99.9=33, 99.99=37] [UPDATE: Count=36223, Max=545, Min=6, Avg=23.88, 90=38, 99=45, 99.9=51, 99.99=56] 
2018-12-30 08:00:02:842 130 sec: 9934115 operations; 72123.3 current ops/sec; est completion in 1 second [READ: Count=685182, Max=33023, Min=0, Avg=12.26, 90=25, 99=29, 99.9=35, 99.99=59] [UPDATE: Count=36106, Max=1208, Min=6, Avg=23.5, 90=37, 99=44, 99.9=52, 99.99=87] 
2018-12-30 08:00:03:746 130 sec: 10000000 operations; 72881.64 current ops/sec; [READ: Count=62472, Max=49, Min=0, Avg=11.75, 90=24, 99=28, 99.9=31, 99.99=34] [CLEANUP: Count=1, Max=26143, Min=26128, Avg=26136, 90=26143, 99=26143, 99.9=26143, 99.99=26143] [UPDATE: Count=3280, Max=53, Min=6, Avg=22.4, 90=36, 99=42, 99.9=47, 99.99=53] 
[OVERALL], RunTime(ms), 130908
[OVERALL], Throughput(ops/sec), 76389.52546826779
[TOTAL_GCS_PS_Scavenge], Count, 22
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 904
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6905613102331408
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 904
[TOTAL_GC_TIME_%], Time(%), 0.6905613102331408
[READ], Operations, 9499616
[READ], AverageLatency(us), 11.522321428571429
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 124671
[READ], 95thPercentileLatency(us), 24
[READ], 99thPercentileLatency(us), 29
[READ], Return=OK, 9499616
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 26136.0
[CLEANUP], MinLatency(us), 26128
[CLEANUP], MaxLatency(us), 26143
[CLEANUP], 95thPercentileLatency(us), 26143
[CLEANUP], 99thPercentileLatency(us), 26143
[UPDATE], Operations, 500384
[UPDATE], AverageLatency(us), 20.86964611178615
[UPDATE], MinLatency(us), 4
[UPDATE], MaxLatency(us), 82047
[UPDATE], 95thPercentileLatency(us), 35
[UPDATE], 99thPercentileLatency(us), 42
[UPDATE], Return=OK, 500384
corrupted double-linked list